import { currentMonth, currentYear } from './modules/controlButtons.js'
import { renderMonth } from './modules/renderMonth.js'
renderMonth(currentMonth, currentYear)

// Рефакторинг коду проекту КАЛЕНДАР з використанням модулів
// Мета:
// Переробити існуючий код JavaScript-календаря, розбивши його на модулі для покращення читабельності, підтримуваності та перевикористання коду.

// Кроки:
// Створення модуля для утиліт:
// Виділіть універсальні функції та константи (наприклад, monthIndexToName, getCurrentDate) в окремий модуль. Назвіть цей файл, наприклад, calendarUtils.js.
// Експортуйте потрібні функції та константи.

// Створення модуля для роботи з DOM:
// Виділіть код, що прямо взаємодіє з DOM (наприклад, знаходження елементів на сторінці), в окремий модуль. Назвіть цей файл, наприклад, DOMManipulations.js.
// Експортуйте елементи DOM, які ви плануєте використовувати в інших модулях.

// Основний модуль:
// Залиште в основному файлі (наприклад, main.js або app.js) тільки логіку, що взаємодіє між різними частинами вашого коду.
// Імпортуйте потрібні функції та елементи DOM з створених модулів.

// Підключення модулів до HTML:
// Підключіть основний JavaScript файл як модуль в HTML за допомогою атрибуту type="module".

// Перевірка:
// Ваш код повинен працювати так само, як і до рефакторингу.
// Кожен модуль повинен мати чітко визначену зону відповідальності.
