// ToDo List з історією змін

// Створіть рішення яке дозволяє користувачеві створювати, редагувати та видаляти завдання, а також зберігає історію всіх змін.
// Основні функції
// Додавання завдання: користувач може додати нове завдання в список.
// Редагування завдання: клікнувши лівою кнопкою мишки на завдання в списку, користувач може його відредагувати.
// Видалення завдання: завдання можна видалити, натиснувши на ньому правою кнопкою мишки.
// Перегляд історії змін: всі дії з завданнями відображаються в історії, яка зберігається в localStorage
// Приклад використання
// Користувач відкриває сторінку і бачить поле для вводу та кнопку для додавання нового завдання. Після введення тексту завдання і натискання кнопки "Додати", завдання додається в список та з'являється у історії змін (на цій самій сторінці, нижче). Користувач може редагувати або видаляти завдання, і ці дії також фіксуються в історії. Завдяки використанню localStorage, всі дані зберігаються між сеансами користування браузером.

const taskInput = document.querySelector('#task')
const taskBtn = document.querySelector('#task-btn')
let dataLocal = JSON.parse(localStorage.getItem('userTasks')) ?? []
taskBtn.addEventListener('click', () => {
  let taskInputValue = taskInput.value

  if (taskInputValue !== '') {
    let data = {
      task: taskInputValue,
    }
    dataLocal.push(data)

    localStorage.setItem('userTasks', JSON.stringify(dataLocal))
  }

  taskInput.value = ''
})
